Revit 2027 API
ParameterTypeId.RebarElemHookStyle Property
 "Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarElemHookStyle { get; }
Public Shared ReadOnly Property RebarElemHookStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemHookStyle {
	ForgeTypeId^ get ();
}
static member RebarElemHookStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace